
#include<STC12C5A60S2.h>
#include<string.h>
#include<pwm.h>
#include<ds1302.h>
#include<lcd1602.h>

/*********************************************************************************************
函数名：毫秒级CPU延时函数
调  用：DELAY_MS (?);
参  数：1~65535（参数不可为0）
返回值：无
结  果：占用CPU方式延时与参数数值相同的毫秒时间
备  注：应用于1T单片机时i<600，应用于12T单片机时i<125
/*********************************************************************************************/
void DELAY_MS (unsigned int a){
	unsigned int i;
	while( a-- != 0){
		for(i = 0; i < 600; i++);
	}
}
/*********************************************************************************************/
// 星期显示的处理函数
void print_xq(void){
		switch (xq)
		{
			case 0x01:print(0x8b,"MON");
			case 0x02:print(0x8b,"TUE");
			case 0x03:print(0x8b,"WED");
			case 0x04:print(0x8b,"THU");
			case 0x05:print(0x8b,"FRI");
			case 0x06:print(0x8b,"SAT");
			case 0x07:print(0x8b,"SUN");
		}
}

/*********************************************************************************************/
// 显示项目 时间部分 在第一行全行显示时间
/*********************************************************************************************/    
void RealTime_Display(void){
	read_clockS();  //首先读取时间
	print(0x80,"20");
	print2(0x82,yy/16+0x30);
	print2(0x83,yy%16+0x30);
	print(0x84,"-");            // 显示年
	//
	print2(0x85,mo/16+0x30);
	print2(0x86,mo%16+0x30);
	print(0x87,"-");            // 显示月
	//
	print2(0x88,dd/16+0x30);
	print2(0x89,dd%16+0x30);
	
	print_xq();
	
	print2(0x40,hh/16+0x30);//小时
	print2(0x41,hh%16+0x30);
	print(0x42,":");            // 显示cgram第一个字模"："
	//
	print2(0x43,mm/16+0x30);//分钟
	print2(0x44,mm%16+0x30);
	print(0x45,":");            // 显示cgram第一个字模"."
	//
	print2(0x46,ss/16+0x30);//秒
	print2(0x47,ss%16+0x30);
	//
}
/********************************************************************************************/

/********************************************************************************************/
//主函数
/********************************************************************************************/

void main (void){   
	PWM_init();	
	LCM2402_Init();//LCM2402初始化  
	BACK = 0;	//有背光
	PWM0_set(0xA0); //偏压调节 越大屏幕字体越黑
	Init_1302();
	while(1){ //主线程// 
		read_clockS();
		RealTime_Display(); 
		DELAY_MS(1000);   //1秒延时
	}
}